Repository: boeotian/lens
Catalog: Lens/Translations/CompilerMessages.*.resx
Languages: ru

# ArgumentTypeMismatch
source: LE3001: Cannot use object of type '{0}' as a value for parameter of type '{1}'!
ru: Невозможно использовать выражения типа '{0}' в качестве значения параметра типа '{1}'!

# ArrayElementTypeMismatch
source: LE3002: Cannot add object of type '{0}' to array of type '{1}'!
ru: Невозможно добавить объект типа '{0}' в массив типа '{1}'!

# ArrayEmpty
source: LE3003: Array initializer must contain at least one object! Use explicit constructor to create an empty array.
ru: Инициализатор массива должен содержать хотя бы один элемент! Для создания пустых массивов воспользуйтесь явным конструктором.

# ArrayTypeUnknown
source: LE3005: Array type cannot be inferred! Use type casting to specify element types.
ru: Тип массива не может быть выведен! Воспользуйтесь операцией приведения типов.

# CallableTooManyArguments
source: LE3006: Cannot create a callable object from a method with more than 16 arguments!
ru: Невозможно создать делегат из метода, принимающего более 16 аргументов.

# CastDelegateArgTypesMismatch
source: LE3007: Delegate types '{0}' and '{1}' do not have matching argument types!
ru: У делегатов '{0}' и '{1}' не совпадают аргументы!

# CastDelegateReturnTypesMismatch
source: LE3008: Delegate types '{0}' and '{1}' do not have matching return types!
ru: У делегатов '{0}' и '{1}' не совпадают возвращаемые значения!

# CastNullValueType
source: LE3009: Cannot cast a null to type '{0}' because it is a value type!
ru: Невозможно привести выражение null к типу '{0}', поскольку он передается по значению!

# CastTypesMismatch
source: LE3010: Cannot cast object of type '{0}' to type '{1}'!
ru: Невозможно привести объект типа '{0}' к типу '{1}'!

# CatchClauseUnreachable
source: LE3011: This catch clause is unreachable, because all exceptions of type '{0}' will be intercepted by a catch clause for '{1}' defined earlier in code!
ru: Это выражение catch недостижимо, поскольку исключения типа '{0}' будут перехвачены выше как наследники типа '{1}'!

# CatchTypeDuplicate
source: LE3012: Type '{0}' has already been used in a catch clause of current try block!
ru: Тип '{0}' уже был использован в выражении catch текущего блока try!

# CatchTypeNotException
source: LE3013: Type '{0}' cannot be used in catch clause because it does not derive from System.Exception!
ru: Тип '{0}' не может быть использован в выражении catch, поскольку он не наследуется от System.Exception!

# ClosureImplicit
source: LE3014: Cannot closure an implicit variable!
ru: Невозможно использовать неявную переменную в замыкании!

# ClosureRef
source: LE3015: Cannot closure argument '{0}' because it is passed by reference!
ru: Невозможно использовать аргумент, передаваемый по ссылке, в замыкании!

# CodeBlockEmpty
source: LE3016: Code block contains no statements!
ru: Блок кода должен содержать хотя бы одно выражение!

# CodeBlockLastVar
source: LE3017: A declaration of a variable or a constant cannot be the last statement in a code block!
ru: Объявление переменной или константы не может быть последним выражением в блоке!

# ConditionInconsistentTyping
source: LE3018: No best common type found for return types of condition branches: '{0}' and '{1}' respectively.
ru: Невозможно определить общий тип для ветвей условия! Типы выражений - '{0}' и '{1}'.

# ConditionTypeMismatch
source: LE3019: Expression of type '{0}' cannot be used as a condition because it is not castable to a boolean!
ru: Выражение типа '{0}' нельзя использовать в качестве условия, поскольку оно не приводится к типу boolean!

# ConstantByRef
source: LE3020: Constant variables cannot be passed by reference!
ru: Константы нельзя передавать в функции по ссылке!

# ConstantDivisionByZero
source: LE3021: Constant division by zero!
ru: Деление на ноль!

# ConstantOverflow
source: LE3022: Result of the constant expression overflows its type!
ru: Результат выражения-константы превышает допустимое максимальное значение типа!

# ConstructorStatic
source: LE3023: A constructor must not be marked as static!
ru: Конструктор не может быть статическим!

# ContextNotFound
source: LE3024: Context #{0} does not exist!
ru: Контекст #{0} не существует!

# ContextUnregistered
source: LE3025: Context #{0} has been unregistered!
ru: Контекст #{0} был освобожден!

# DelegateArgumentsCountMismatch
source: LE3026: Invoking a delegate of type '{0}' requires {1} arguments, {2} given instead!
ru: Вызов делегата типа '{0}' требует {1} аргументов, а передано {2}!

# DelegatesNotCombinable
source: LE3027: Delegates of types '{0}' and '{1}' cannot be combined because their signatures are incompatible!
ru: Невозможно применить композицию к делегатам типов '{0}' и '{1}', поскольку их подписи несовместимы!

# DictionaryEmpty
source: LE3028: Dictionary initializer must contain at least one key-value pair! Use explicit constructor to create an empty dictionary.
ru: Инициализатор словаря должен содержать хотя бы один элемент! Для создания пустых словарей воспользуйтесь явным конструктором.

# DictionaryKeyTypeMismatch
source: LE3029: Cannot add a key of type '{0}' to Dictionary<{1}, {2}>!
ru: Невозможно добавить ключ типа '{0}' в Dictionary<{1}, {2}>!

# DictionaryTypeUnknown
source: LE3030: Dictionary type cannot be inferred! Use type casting to specify element types.
ru: Тип словаря не может быть выведен! Воспользуйтесь операцией приведения типов.

# DictionaryValueTypeMismatch
source: LE3031: Cannot add a value of type '{0}' to Dictionary<{1}, {2}>!
ru: Невозможно добавить значение типа '{0}' в Dictionary<{1}, {2}>!

# DynamicMemberFromStaticContext
source: LE3032: '{0}' cannot be accessed from static context!
ru: Невозможно получить доступ к '{0}' из статического контекста!

# ExpressionNull
source: LE3034: Expression type cannot be inferred! Please use type casting to specify actual type.
ru: Тип выражения не может быть выведен! Воспользуйтесь операцией приведения типов.

# ExpressionVoid
source: LE3035: Expression that returns a value is expected!
ru: Требуется выражение, возвращающее значение!

# ForeachRangeNotInteger
source: LE3037: Type '{0}' cannot be used as range limit because it is not an integer!
ru: Тип '{0}' невозможно использовать в качестве границы диапазона, поскольку он не является целочисленным!

# ForeachRangeTypeMismatch
source: LE3038: Cannot create a range from expressions of types '{0}' and '{1}'!
ru: Невозможно получить диапазон из выражений типов '{0}' и '{1}'!

# FunctionInvocationAmbiguous
source: LE3039: There is more than one suitable override of function '{0}'! Please use type casting to specify the exact override.
ru: Найдено несколько подходящих переопределений функции '{0}'! Воспользуйтесь операцией приведения типов для указания конкретного переопределения!

# FunctionNotFound
source: LE3040: No function named '{0}' with suitable arguments is declared!
ru: Не найдено ни одного переопределения функции '{0}', принимающей переданные аргументы!

# FunctionRedefinition
source: LE3041: A function named '{0}' with identical set of arguments has already been defined!
ru: Функция '{0}' с таким списком аргументов уже была объявлена!

# GenericArgCountMismatch
source: LE3042: Number of generic arguments does not match!
ru: Количество обобщенных аргументов не совпадает!

# GenericArgMismatch
source: LE3043: Generic argument '{0}' has mismatched values: '{1}' and '{2}'!
ru: Для обобщенного аргумента '{0}' переданы несовпадающие значения: '{1}' и '{2}'!

# GenericArgsToNonGenericMethod
source: LE3044: Cannot apply generic arguments to non-generic method '{0}'!
ru: Метод '{0}' не принимает обобщенных аргументов!

# GenericArgumentNotResolved
source: LE3045: Generic argument '{0}' could not be resolved!
ru: Значение обобщенного аргумента '{0}' не может быть вычислено!

# GenericClassConstraintViolated
source: LE3046: Type '{0}' cannot be used as value for generic argument '{1}' of type '{2}' because it is not a reference type!
ru: Тип '{0}' не может быть использован как значение обобщенного аргумента '{1}' для типа '{2}', поскольку не является ссылочным типом!

# GenericConstructorConstraintViolated
source: LE3047: Type '{0}' cannot be used as value for generic argument '{1}' of type '{2}' because it does not have a default constructor!
ru: Тип '{0}' не может быть использован как значение обобщенного аргумента '{1}' для типа '{2}', поскольку не имеет конструктор по умолчанию!

# GenericHintMismatch
source: LE3048: Generic argument '{0}' was has hint type '{1}', but inferred type was '{2}'!
ru: Для обобщенного аргумента '{0}' был явно указан тип '{1}', но использование подразумевает тип '{2}'!

# GenericImplementationWrongType
source: LE3049: Cannot resolve arguments of '{0}' using type '{1}'!
ru: Невозможно вычислить значение обобщенного аргумента '{0}', используя тип '{1}'!

# GenericInheritanceConstraintViolated
source: LE3050: Type '{0}' cannot be used as value for generic argument '{1}' of type '{2}' because it does not implement class or interface '{3}'!
ru: Тип '{0}' не может быть использован как значение обобщенного аргумента '{1}' для типа '{2}', поскольку не реализует класс или интерфейс '{3}'!

# GenericInterfaceMultipleImplementations
source: LE3051: Cannot infer argument types of '{0}': type '{1}' implements multiple overrides!
ru: Невозможно определить обобщенные аргументы интерфейса '{0}': тип '{1}' реализует несколько его переопределений!

# GenericInterfaceNotImplemented
source: LE3052: Type '{0}' does not implement any kind of interface '{1}'!
ru: Тип '{0}' не реализует интерфейс '{1}'!

# GenericParameterNotFound
source: LE3053: Generic parameter '{0}' was not found!
ru: Обобщенный аргумент '{0}' не был найден!

# GenericStructConstraintViolated
source: LE3054: Type '{0}' cannot be used as value for generic argument '{1}' of type '{2}' because it is not a value type!
ru: Тип '{0}' не может быть использован как значение обобщенного аргумента '{1}' для типа '{2}', поскольку не является передаваемым по значению!

# GlobalPropertyNoGetter
source: LE3055: Global property '{0}' has no getter!
ru: Невозможно получить значение глобального свойства '{0}'!

# GlobalPropertyNoSetter
source: LE3056: Global property '{0}' has no setter!
ru: Невозможно задать значение глобального свойства '{0}'!

# GlobalPropertyTypeMismatch
source: LE3057: Cannot assign a value of type '{0}' to a global property of type '{1}'! An explicit cast might be required.
ru: Невозможно присвоить глобальному свойству '{0}' значение типа '{1}'! Возможно, требуется явное приведение типа.

# IdentifierIsConstant
source: LE3058: '{0}' is a constant and cannot be assigned after definition!
ru: '{0}' является константой и изменение ее значения запрещено!

# IdentifierNotFound
source: LE3059: No local variable or global parameterless function named '{0}' was found!
ru: Переменная или функция без параметров с названием '{0}' не найдена!

# IdentifierTypeMismatch
source: LE3060: Cannot assign a value of type '{0}' to a variable of type '{1}'! An explicit cast might be required.
ru: Невозможно присвоить значение типа '{0}' переменной типа '{1}'! Возможно. требуется явное приведение типа.

# ImplicitCastImpossible
source: LE3061: Cannot implicitly convert an object of type '{0}' to required type '{1}'!
ru: Невозможно неявно привести выражение типа '{0}' к типу '{1}'!

# ImportIntoSaveableAssembly
source: LE3062: Entities cannot be imported into a saveable assembly!
ru: Сохраняемые сборки не поддерживают импорт!

# ImportUnsupportedMethod
source: LE3063: Only public, static, non-generic methods can be imported!
ru: Только публичные, статические и не содержащие обобщенных аргументов методы могут быть импортированы!

# IndexAmbigious
source: LE3064: Indexer is ambigious! At least two cases apply:{3}{0}[{1}]{3}{0}[{2}]
ru: Индексатор не может быть однозначно определен! Подходят как минимум два переопределения:{3}{0}[{1}]{3}{0}[{2}]

# IndexerValuetypeRef
source: LE3065: Cannot use a custom indexer of type '{0}' as a ref parameter, because it returns '{1}' which is valuetype!
ru: Нельзя использовать индексатор типа '{0}' в качестве значения для ref-параметра, поскольку возвращаемый им тип '{1}' передается по значению!

# IndexGetterNotFound
source: LE3066: Type '{0}' has no index getter that accepts an index of type '{1}'!
ru: Тип '{0}' не содержит индексатора на чтение, который бы принимал индекс типа '{1}'!

# IndexSetterNotFound
source: LE3067: Type '{0}' has no index setter that accepts an index of type '{1}'!
ru: Тип '{0}' не содержит индексатора на запись, который бы принимал индекс типа '{1}'!

# LambdaReturnTypeUnknown
source: LE3071: Lambda return type cannot be inferred! Please use type casting to specify type.
ru: Возвращаемый тип анонимной функции не может быть выведен! Воспользуйтесь операцией приведения типов.

# ListElementTypeMismatch
source: LE3072: Cannot add object of type '{0}' to List<{1}>!
ru: Невозможно добавить объект типа '{0}' в List<{1}>!

# ListEmpty
source: LE3073: List initializer must contain at least one object! Use explicit constructor to create an empty list.
ru: Инициализатор списка должен содержать хотя бы один элемент! Для создания пустых списков воспользуйтесь явным конструктором.

# ListTypeUnknown
source: LE3074: List type cannot be inferred! Use type casting to specify element types.
ru: Тип списка не может быть выведен! Воспользуйтесь операцией приведения типов.

# Location
source: LE3075: Location: {0}
ru: Позиция: {0}

# LocationSpan
source: LE3076: Location: {0} ... {1}
ru: Позиция: {0} ... {1}

# MethodRedefinition
source: LE3077: A method named '{0}' in type '{1}' with identical set of arguments has already been defined!
ru: Метод '{0}' типа '{1}' с таким списком аргументов уже был объявлен!

# MethodRef
source: LE3078: Cannot use a method as a ref parameter!
ru: Нельзя использовать метод в качестве значения для ref-параметра!

# OperatorBinaryTypesMismatch
source: LE3079: Cannot apply operator '{0}' to arguments of types '{1}' and '{2}'!
ru: Невозможно применить оператор '{0}' к аргументам типов '{1}' и '{2}'!

# OperatorTypesSignednessMismatch
source: LE3080: Cannot apply apply math operations to arguments of different signedness!
ru: Невозможно провести математическую операцию к числам разной знаковости!

# OperatorUnaryTypeMismatch
source: LE3081: Cannot apply operator '{0}' to argument of type '{1}'!
ru: Невозможно применить оператор '{0}' к аргументу типа '{1}'!

# ParameterlessConstructorParens
source: LE3082: A parameterless constructor must be invoked by applying a () to it!
ru: Для вызова конструктора без параметров требуется указать пустые скобки!

# PropertyIdNoGetter
source: LE3083: Property #{0} has no getter!
ru: Значение свойства #{0} не может быть получено!

# PropertyIdNoSetter
source: LE3084: Property #{0} has no setter!
ru: Значение свойства #{0} не может быть задано!

# PropertyIdNotFound
source: LE3085: Property #{0} does not exist!
ru: Свойство #{0} не найдено!

# PropertyImported
source: LE3086: Property '{0}' has already been imported!
ru: Свойство '{0}' уже было импортировано!

# PropertyNoGetter
source: LE3087: Property '{0}.{1}' does not have a getter!
ru: Значение свойства '{0}.{1}' не может быть получено!

# PropertyNoSetter
source: LE3088: Property '{0}.{1}' does not have a setter!
ru: Значение свойства '{0}.{1}' не может быть задано!

# PropertyValuetypeRef
source: LE3089: Cannot use property '{0}.{1}' as a ref parameter, because it returns '{2}' which is valuetype!
ru: Нельзя использовать свойство '{0}.{1}' в качестве значения для ref-параметра, поскольку возвращаемый им тип '{2}' передается по значению!

# PureFunctionReturnUnit
source: LE3090: Function '{0}' cannot be marked as pure because it does not return a value!
ru: Функция '{0}' не может быть чистой, поскольку не возвращает значения!

# PureFunctionTooManyArgs
source: LE3091: Function '{0}' cannot be marked as pure because it contains more than 7 arguments!
ru: Функция '{0}' не может быть чистой, поскольку содержит больше 7 аргументов!

# ReferenceArgExpected
source: LE3092: Argument {0} requires a reference of type '{1}'!
ru: Аргумент {0} требует ссылку типа '{1}'!

# ReferenceArgUnexpected
source: LE3093: Cannot use reference as a value for non-reference argument!
ru: Нельзя использовать ссылку в качестве значения не-ссылочного параметра!

# ReservedFunctionInvocation
source: LE3094: Cannot invoke function '{0}' because it is reserved for internal purposes.
ru: Невозможно вызвать функцию '{0}', поскольку она является зарезервированной!

# ReservedFunctionRedefinition
source: LE3095: Cannot define a function named '{0}' because it is reserved for internal purposes.
ru: Невозможно объявить функцию с именем '{0}', поскольку она является зарезервированной!

# ReturnTypeMismatch
source: LE3096: Function of type '{0}' cannot return an expression of type '{1}'!
ru: Функция типа '{0}' не может вернуть объект типа '{1}'!

# SafeModeIllegalType
source: LE3097: Type '{0}' cannot be used in the script due to safe mode settings!
ru: Растройки безопасного режима не позволяют использовать тип '{0}'!

# ThrowArgumentExpected
source: LE3098: Expression is expected! An exception can only be rethrown from a catch clause.
ru: Требуется выражение! Повторный выброс исключения допустим только в выражении catch.

# ThrowTypeNotException
source: LE3099: Type '{0}' cannot be used in throw statement because it does not derive from System.Exception!
ru: Тип '{0}' не может быть использован в выражении throw, поскольку он не наследуется от System.Exception!

# TupleNoArgs
source: LE3100: Tuple must contain at least one object!
ru: Кортеж должен содержать хотя бы один объект!

# TupleTooManyArgs
source: LE3101: Tuples cannot contain more than 8 objects! Use a structure or a nested tuple instead.
ru: Кортеж не может содержать больше 8 объектов! Воспользуйтесь структурой или вложенным кортежом.

# TypeAbstract
source: LE3102: Cannot create an instance of type '{0}' because it is abstract!
ru: Невозможно создать экземпляр абстрактного типа '{0}'!

# TypeArgumentsForNonMethod
source: LE3103: Type arguments cannot be applied to '{0}.{1}' because it is not a method!
ru: Невозможно применить обобщенные параметры к '{0}.{1}', потому что это не метод!

# TypeConstructorAmbiguos
source: LE3104: Type '{0}' has more than one suitable constructor! Please use type casting to specify the exact override.
ru: Тип '{0}' содержит несколько подходящих конструкторов! Воспользуйтесь операцией приведения типов .

# TypeConstructorNotFound
source: LE3105: Type '{0}' does not have a constructor accepting given arguments!
ru: Тип '{0}' не содержит конструктор с подходящим списком аргументов!

# TypeDefined
source: LE3106: Type '{0}' has already been defined!
ru: Тип '{0}' уже объявлен!

# TypeIdentifierNotFound
source: LE3107: Type '{0}' does not have any field, property or method called '{1}'!
ru: Тип '{0}' не содержит свойства, метода или поля под названием '{1}'!

# TypeIsAmbiguous
source: LE3109: Ambigious type reference: type '{0}' is found in the following namespaces:{5}{1} in assembly {2}{5}{3} in assembly {4}
ru: Неоднозначное указание типа: тип '{0}' найден как минимум в двух пространствах имен:{5}{1} в сборке {2}{5}{3} в сборке {4}

# TypeMethodAmbiguous
source: LE3110: Type '{0}' has more than one suitable override of '{1}'! Please specify type arguments.
ru: Тип '{0}' содержит несколько подходящих переопределений метода '{1}'! Укажите типы аргументов явно.

# TypeMethodInvocationAmbiguous
source: LE3111: Type '{0}' has more than one suitable override of '{1}'! Please use type casting to specify the exact override.
ru: Тип '{0}' содержит несколько подходящих переопределений метода '{1}'! Воспользуйтесь операцией приведения типов.

# TypeMethodNotFound
source: LE3112: Type '{0}' has no method named '{1}' and no extension method accepting given arguments was found!
ru: Тип '{0}' не содержит метод '{1}' с подходящим списков аргументов! Соответствующий метод-расширение также не найден.

# TypeNotCallable
source: LE3113: Cannot pass arguments to expression of type '{0}', because it is not callable!
ru: Невозможно передать аргументы выражению типа '{0}', поскольку он не является функцией!

# TypeNotFound
source: LE3114: Type '{0}' could not be resolved!
ru: Тип '{0}' не найден!

# TypeNotImplicitlyBoolean
source: LE3115: Type '{0}' cannot be used in a boolean context!
ru: Тип '{0}' нельзя использовать в булевом контексте!

# TypeNotIterable
source: LE3116: Type '{0}' is not iterable!
ru: Тип '{0}' не является перечислимым!

# TypeNotNumeric
source: LE3117: Type '{0}' is not numeric!
ru: Тип '{0}' не является числовым!

# TypeSettableIdentifierNotFound
source: LE3118: Type '{0}' does not contain a field or a property named '{1}'!
ru: Тип '{0}' не содержит поля или свойства '{1}'!

# TypesIncomparable
source: LE3119: Types '{0}' and '{1}' cannot be compared!
ru: Невозможно сравнить объекты типов '{0}' и '{1}'!

# UnderscoreName
source: LE3121: The '_' identifier is special and cannot be used for arguments, variable names, and any other user-defined entities!
ru: Идентификатор '_' является зарезервированным и не может быть использован в названиях переменных, аргументов или любых других объявленных пользователем сущностей!

# VariableDefined
source: LE3123: A variable named '{0}' is already defined!
ru: Переменная '{0}' уже объявлена!

# VariableNotFound
source: LE3124: A variable named '{0}' does not exist in the scope!
ru: Переменная '{0}' не объявлена в данной области видимости!

# VoidTypeDefault
source: LE3127: Cannot create an instance of Unit or Void types!
ru: Невозможно создать экземпляр типа Unit или void!

# TypeStaticMethodNotFound
source: LE3120: Type '{0}' has no method named '{1}'!
ru: Тип '{0}' не содержит метод '{1}' с подходящим списком аргументов!

# FieldRedefinition
source: LE3036: Type '{0}' already contains field named '{1}'!
ru: Тип '{0}' уже содержит поле '{1}'!
